"""GIT - распределенная система контроля версий"""
#Это система для отслеживания и ведения истории изменения файлов в вашем проекте

# Репозиторий - хранилище вашего кода и истории его изменений

# GITHub - веб сайт для размещения git - репозиториев и совместной разработки проектов


"""Команды GIT"""
#1. git init - создает новый гит репозиторий локально на вашем ПК

#2. git commit - как только мы достигаем определенного момента в разработке, то тогда мы сохраняем и комментируем изменения. (фиаксация изменений в репо)
# git commit -m '<comment>'

#3. git add - когда мы создаем или изменяем файлы, то при помощи этой команды мы загружаем все изменения в локальное хранилище

# git add <название файла>
# git add .

