"""GIT - распределенная система контроля версий"""
#Это система для отслеживания и ведения истории изменения файлов в вашем проекте

# Репозиторий - хранилище вашего кода и истории его изменений

# GITHub - веб сайт для размещения git - репозиториев и совместной разработки проектов


"""Команды GIT"""
#1. git init - создает новый гит репозиторий локально на вашем ПК

#2. git commit - как только мы достигаем определенного момента в разработке, то тогда мы сохраняем и комментируем изменения. (фиаксация изменений в репо)
# git commit -m '<comment>'

#3. git add - когда мы создаем или изменяем файлы, то при помощи этой команды мы загружаем все изменения в локальное хранилище

# git add <название файла>
# git add .

#4. git remote add - это команда для того, чтобы связать ваш проект с удаленным репозиторием (репо в гитхаб)
# git remote add <название подключения> <ссылка на репо>
# git remote add origin <url>

#5. git push - после коммита изменений при помощи этой команды мы отправляем наши изменения на удаленный репозиторий

# git push <название ветки>

# --------------------------------------------------------------------------------------------------------------------

#6. git branch. Ветки очень важны в git. При помощи веток несколько программистов могут работать параллельно на одном и том же проекте. При помощи команды git branch мы можем создавать, просматривать или удалять ветки.
# Создание ветки: git branch <название ветки>
# Просмотр ветки: git branch or git branch --list
# Удаление ветки: git branch -d <название ветки>

#7. git checkout - команда используется для работы в команде, она помогает переключаться по веткам.
# git checkout <название ветки>

# Строчка ветки janylai
